app/views/orders/index.html.haml

SELECT "orders".* FROM "orders"
---
.page-header
  %h1= t('headers.orders.index')