app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.user = @current_user

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("description", "price", "promo_input", "user_id", "created_at", "updated_at", "promo_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["description", "*****"], ["price", 10000.0], ["promo_input", "111"], ["user_id", 1], ["created_at", "2017-09-21 09:17:25.513215"], ["updated_at", "2017-09-21 09:17:25.513215"], ["promo_id", 2]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "promo_input" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["promo_input", "49J"], ["updated_at", "2017-09-21 10:36:07.856634"], ["id", 10]]