app/controllers/promos_controller.rb

SELECT "promos".* FROM "promos"
---
  def index
    @promos = Promo.all

INSERT INTO "promos" ("name", "sale", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "111"], ["sale", 1.0], ["quantity", 1], ["created_at", "2017-09-20 20:45:02.497364"], ["updated_at", "2017-09-20 20:45:02.497364"]]
---
  def create
    @promo = Promo.new(promo_params)

    respond_to do |format|
      if @promo.save

UPDATE "promos" SET "quantity" = $1, "updated_at" = $2 WHERE "promos"."id" = $3  [["quantity", 1], ["updated_at", "2017-09-21 09:50:17.757176"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @promo.update(promo_params)

SELECT  "promos".* FROM "promos" WHERE "promos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_promo
      @promo = Promo.find(params[:id])