app/controllers/role_users_controller.rb

  def index
    @role_users = RoleUser.all
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  ORDER BY "role_users"."id" ASC LIMIT 1  [["user_id", 2]]

    def set_role_user
      @role_user = RoleUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]