app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  ORDER BY "role_users"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "salt", "crypted_password", "created_at", "updated_at", "activation_token", "activation_state") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def create_by_admin
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "role_users" ("role_id", "data", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["role_id", 1], ["data", "{\"data\":\"\"}"], ["user_id", 3], ["created_at", "2017-09-21 11:06:38.154255"], ["updated_at", "2017-09-21 11:06:38.154255"]]
INSERT INTO "users" ("email", "salt", "crypted_password", "created_at", "updated_at", "activation_token", "activation_state") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_activity_at" = '2017-09-20 23:00:12.077787' WHERE "users"."id" = $1  [["id", 1]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  ORDER BY "role_users"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]