app/controllers/welcome_controller.rb

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1  ORDER BY "role_users"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def insufficient_privileges
    @current_user_object = current_user
    @current_user_login = @current_user_object.email
    @current_role_user = RoleUser.where(id: params['bad_user_role']).first